{
    "books": [
        {
            "title": "Introdução a Data Science",
            "authors": "['Tatiana Escovedo', 'Adriano Koshiyama']",
            "description": "Nosso cenário mundial atual é caracterizado pela criação e crescimento de inúmeras bases de dados em velocidade exponencial. Para processar e obter informação útil a partir destes dados, é necessário automatizar diversas tarefas de coleta, processamento e análise de dados. A vasta área de Data Science (ou Ciência de Dados) refere-se a um conjunto de métodos com o objetivo apoiar decisões de negócio, a partir da coleta de dados de várias fontes para fins de análise, de forma sistematizada. Neste livro, Tatiana Escovedo e Adriano Koshiyama focam no processo e nas técnicas relacionadas aos algoritmos preditivos mais comumente utilizados, mas mostrando também a importância da etapa de preparação dos dados brutos, limpeza e análise. Você vai aprender como utilizar Data Science para resolver problemas e agregar valor ao negócio, aprendendo com os dados. O trajeto inicia com uma introdução a conceitos de Estatística e Álgebra Linear, passando para o tema Pré-processamento de dados, uma etapa importantíssima para o entendimento do problema e preparação dos dados para a aplicação dos algoritmos de Machine Learning, chegando aos modelos de Classificação, Regressão, Associação e Agrupamento. Todos os conceitos teóricos apresentados serão complementados com exemplos práticos na linguagem R.",
            "selfLink": "https://www.googleapis.com/books/v1/volumes/cL7TDwAAQBAJ"
        },
        {
            "title": "Data Science",
            "authors": "['Field Cady']",
            "description": "Tap into the power of data science with this comprehensive resource for non-technical professionals Data Science: The Executive Summary – A Technical Book for Non-Technical Professionals is a comprehensive resource for people in non-engineer roles who want to fully understand data science and analytics concepts. Accomplished data scientist and author Field Cady describes both the \"business side\" of data science, including what problems it solves and how it fits into an organization, and the technical side, including analytical techniques and key technologies. Data Science: The Executive Summary covers topics like: Assessing whether your organization needs data scientists, and what to look for when hiring them When Big Data is the best approach to use for a project, and when it actually ties analysts’ hands Cutting edge Artificial Intelligence, as well as classical approaches that work better for many problems How many techniques rely on dubious mathematical idealizations, and when you can work around them Perfect for executives who make critical decisions based on data science and analytics, as well as mangers who hire and assess the work of data scientists, Data Science: The Executive Summary also belongs on the bookshelves of salespeople and marketers who need to explain what a data analytics product does. Finally, data scientists themselves will improve their technical work with insights into the goals and constraints of the business situation.",
            "selfLink": "https://www.googleapis.com/books/v1/volumes/u28LEAAAQBAJ"
        },
        {
            "title": "Projetos de ciência de dados com Python",
            "authors": "['Stephen Klosterman']",
            "description": "Projetos de ciência de dados com Python foi pensado para oferecer orientação prática sobre ferramentas padrão para análise de dados e machine learning em Python com a ajuda de dados reais. O curso o ajudará a entender como usar pandas e o Matplotlib para examinar criticamente um dataset com sínteses estatísticas e gráficos e extrair os insights que deseja obter. Você continuará adquirindo conhecimento ao aprender a preparar dados e a fornecê-los para algoritmos de machine learning, como o de regressão logística regularizada e o de floresta aleatória, usando o pacote scikit-learn. Também aprenderá como ajustar algoritmos para fornecer as melhores previsões sobre dados novos não conhecidos. À medida que percorrer os capítulos mais avançados, conhecerá o funcionamento e a saída desses algoritmos e entenderá melhor não só os recursos preditivos dos modelos, mas também o que os leva a fazer essas previsões. No fim do curso, você terá as habilidades necessárias para usar confiantemente vários algoritmos de machine learning a fim de executar análises de dados detalhadas e extrair insights significativos dos dados. Objetivos do livro: • Instalação dos pacotes necessários para a definição de um ambiente de codificação de ciência de dados • Carregamento de dados em um Jupyter Notebook executando Python • Uso do Matplotlib para a criação de visualizações de dados • Criação de um modelo com o uso do scikit-learn • Uso do lasso e da regressão ridge para dedução do overfitting • Criação e ajuste de um modelo de floresta aleatória e comparação do desempenho com o da regressão logística • Criação de visualizações com o uso da saída do Jupyter Notebook.",
            "selfLink": "https://www.googleapis.com/books/v1/volumes/eX_iDwAAQBAJ"
        },
        {
            "title": "Python for Data Science For Dummies",
            "authors": "['John Paul Mueller', 'Luca Massaron']",
            "description": "Let Python do the heavy lifting for you as you analyze large datasets Python for Data Science For Dummies lets you get your hands dirty with data using one of the top programming languages. This beginner’s guide takes you step by step through getting started, performing data analysis, understanding datasets and example code, working with Google Colab, sampling data, and beyond. Coding your data analysis tasks will make your life easier, make you more in-demand as an employee, and open the door to valuable knowledge and insights. This new edition is updated for the latest version of Python and includes current, relevant data examples. Get a firm background in the basics of Python coding for data analysis Learn about data science careers you can pursue with Python coding skills Integrate data analysis with multimedia and graphics Manage and organize data with cloud-based relational databases Python careers are on the rise. Grab this user-friendly Dummies guide and gain the programming skills you need to become a data pro.",
            "selfLink": "https://www.googleapis.com/books/v1/volumes/YfPaEAAAQBAJ"
        },
        {
            "title": "Data Science for Web3",
            "authors": "['Gabriela Castillo Areco']",
            "description": "Be part of the future of Web3, decoding blockchain data to build trust in the next-generation internet Key Features Build a deep understanding of the fundamentals of blockchain analytics Extract actionable business insights by modeling blockchain data Showcase your work and gain valuable experience to seize opportunities in the Web3 ecosystem Purchase of the print or Kindle book includes a free PDF eBook Book DescriptionData is the new oil and Web3 is generating it at an unprecedented rate. Complete with practical examples, detailed explanations, and ideas for portfolio development, this comprehensive book serves as a step-by-step guide covering the industry best practices, tools, and resources needed to easily navigate the world of data in Web3. You’ll begin by acquiring a solid understanding of key blockchain concepts and the fundamental data science tools essential for Web3 projects. The subsequent chapters will help you explore the main data sources that can help address industry challenges, decode smart contracts, and build DeFi- and NFT-specific datasets. You’ll then tackle the complexities of feature engineering specific to blockchain data and familiarize yourself with diverse machine learning use cases that leverage Web3 data. The book includes interviews with industry leaders providing insights into their professional journeys to drive innovation in the Web 3 environment. Equipped with experience in handling crypto data, you’ll be able to demonstrate your skills in job interviews, academic pursuits, or when engaging potential clients. By the end of this book, you’ll have the essential tools to undertake end-to-end data science projects utilizing blockchain data, empowering you to help shape the next-generation internet.What you will learn Understand the core components of blockchain transactions and blocks Identify reliable sources of on-chain and off-chain data to build robust datasets Understand key Web3 business questions and how data science can offer solutions Build your skills to create and query NFT- and DeFi-specific datasets Implement a machine learning toolbox with real-world use cases in the Web3 space Who this book is for This book is designed for data professionals—data analysts, data scientists, or data engineers— and business professionals, aiming to acquire the skills for extracting data from the Web3 ecosystem, as it demonstrates how to effectively leverage data tools for in-depth analysis of blockchain transactional data. If you seek hands-on experience, you'll find value in the shared repository, enabling you to experiment with the provided solutions. While not mandatory, a basic understanding of statistics, machine learning, and Python will enhance your learning experience.",
            "selfLink": "https://www.googleapis.com/books/v1/volumes/vdTrEAAAQBAJ"
        },
        {
            "title": "Advances in Data Science and Management",
            "authors": "['Samarjeet Borah', 'Valentina Emilia Balas', 'Zdzislaw Polkowski']",
            "description": "This book includes high-quality papers presented at the International Conference on Data Science and Management (ICDSM 2019), organised by the Gandhi Institute for Education and Technology, Bhubaneswar, from 22 to 23 February 2019. It features research in which data science is used to facilitate the decision-making process in various application areas, and also covers a wide range of learning methods and their applications in a number of learning problems. The empirical studies, theoretical analyses and comparisons to psychological phenomena described contribute to the development of products to meet market demands.",
            "selfLink": "https://www.googleapis.com/books/v1/volumes/9S_KDwAAQBAJ"
        },
        {
            "title": "Data Science on the Google Cloud Platform",
            "authors": "['Valliappa Lakshmanan']",
            "description": "Learn how easy it is to apply sophisticated statistical and machine learning methods to real-world problems when you build using Google Cloud Platform (GCP). This hands-on guide shows data engineers and data scientists how to implement an end-to-end data pipeline with cloud native tools on GCP. Throughout this updated second edition, you'll work through a sample business decision by employing a variety of data science approaches. Follow along by building a data pipeline in your own project on GCP, and discover how to solve data science problems in a transformative and more collaborative way. You'll learn how to: Employ best practices in building highly scalable data and ML pipelines on Google Cloud Automate and schedule data ingest using Cloud Run Create and populate a dashboard in Data Studio Build a real-time analytics pipeline using Pub/Sub, Dataflow, and BigQuery Conduct interactive data exploration with BigQuery Create a Bayesian model with Spark on Cloud Dataproc Forecast time series and do anomaly detection with BigQuery ML Aggregate within time windows with Dataflow Train explainable machine learning models with Vertex AI Operationalize ML with Vertex AI Pipelines",
            "selfLink": "https://www.googleapis.com/books/v1/volumes/TiRnEAAAQBAJ"
        },
        {
            "title": "Practical Data Science for Information Professionals",
            "authors": "['David Stuart']",
            "description": "Practical Data Science for Information Professionals provides an accessible introduction to a potentially complex field, providing readers with an overview of data science and a framework for its application. It provides detailed examples and analysis on real data sets to explore the basics of the subject in three principle areas: clustering and social network analysis; predictions and forecasts; and text analysis and mining. As well as highlighting a wealth of user-friendly data science tools, the book also includes some example code in two of the most popular programming languages (R and Python) to demonstrate the ease with which the information professional can move beyond the graphical user interface and achieve significant analysis with just a few lines of code. After reading, readers will understand: · the growing importance of data science · the role of the information professional in data science · some of the most important tools and methods that information professionals can use. Bringing together the growing importance of data science and the increasing role of information professionals in the management and use of data, Practical Data Science for Information Professionals will provide a practical introduction to the topic specifically designed for the information community. It will appeal to librarians and information professionals all around the world, from large academic libraries to small research libraries. By focusing on the application of open source software, it aims to reduce barriers for readers to use the lessons learned within.",
            "selfLink": "https://www.googleapis.com/books/v1/volumes/2TjzDwAAQBAJ"
        },
        {
            "title": "Data Science for Water Utilities",
            "authors": "['Peter Prevos']",
            "description": "This addition to the Data Science Series introduces the principles of data science and the R language to the singular needs of water professionals. The book provides unique data and examples relevant to managing water utility and is sourced from the author’s extensive experience. Data Science for Water Utilities: Data as a Source of Value is an applied, practical guide that shows water professionals how to use data science to solve urban water management problems. Content develops through four case studies. The first looks at analysing water quality to ensure public health. The second considers customer feedback. The third case study introduces smart meter data. The guide flows easily from basic principles through code that, with each case study, increases in complexity. The last case study analyses data using basic machine learning. Readers will be familiar with analysing data but do not need coding experience to use this book. The title will be essential reading for anyone seeking a practical introduction to data science and creating value with R.",
            "selfLink": "https://www.googleapis.com/books/v1/volumes/vbi6EAAAQBAJ"
        },
        {
            "title": "Machine Learning, Optimization, and Data Science",
            "authors": "['Giuseppe Nicosia', 'Panos Pardalos', 'Giovanni Giuffrida', 'Renato Umeton', 'Vincenzo Sciacca']",
            "description": "This book constitutes the post-conference proceedings of the 4th International Conference on Machine Learning, Optimization, and Data Science, LOD 2018, held in Volterra, Italy, in September 2018.The 46 full papers presented were carefully reviewed and selected from 126 submissions. The papers cover topics in the field of machine learning, artificial intelligence, reinforcement learning, computational optimization and data science presenting a substantial array of ideas, technologies, algorithms, methods and applications.",
            "selfLink": "https://www.googleapis.com/books/v1/volumes/hFWIDwAAQBAJ"
        }
    ]
}